ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sysctrl.h
/*
 * Component description for SYSCTRL
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_SYSCTRL_COMPONENT_H_
#define _SAMD21_SYSCTRL_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SYSCTRL                                      */
/* ************************************************************************** */

/* -------- SYSCTRL_INTENCLR : (SYSCTRL Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#define SYSCTRL_INTENCLR_RESETVALUE _UINT32_(0x00) /*  (SYSCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SYSCTRL_INTENCLR_XOSCRDY_Pos _UINT32_(0) /* (SYSCTRL_INTENCLR) XOSC Ready Interrupt Enable Position */
#define SYSCTRL_INTENCLR_XOSCRDY_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_XOSCRDY_Pos) /* (SYSCTRL_INTENCLR) XOSC Ready Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_XOSCRDY(value)                                                                                \
        (SYSCTRL_INTENCLR_XOSCRDY_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_XOSC32KRDY_Pos _UINT32_(1) /* (SYSCTRL_INTENCLR) XOSC32K Ready Interrupt Enable Position */
#define SYSCTRL_INTENCLR_XOSC32KRDY_Msk                                                                                \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_XOSC32KRDY_Pos) /* (SYSCTRL_INTENCLR) XOSC32K Ready Interrupt Enable Mask   \
                                                            */
#define SYSCTRL_INTENCLR_XOSC32KRDY(value)                                                                             \
        (SYSCTRL_INTENCLR_XOSC32KRDY_Msk &                                                                             \
         (_UINT32_(value) << SYSCTRL_INTENCLR_XOSC32KRDY_Pos)) /* Assigment of value for XOSC32KRDY in the             \
                                                                  SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_OSC32KRDY_Pos _UINT32_(2) /* (SYSCTRL_INTENCLR) OSC32K Ready Interrupt Enable Position */
#define SYSCTRL_INTENCLR_OSC32KRDY_Msk                                                                                 \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_OSC32KRDY_Pos) /* (SYSCTRL_INTENCLR) OSC32K Ready Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_OSC32KRDY(value)                                                                              \
        (SYSCTRL_INTENCLR_OSC32KRDY_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_OSC32KRDY_Pos)) /* Assigment of value for OSC32KRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_OSC8MRDY_Pos _UINT32_(3) /* (SYSCTRL_INTENCLR) OSC8M Ready Interrupt Enable Position */
#define SYSCTRL_INTENCLR_OSC8MRDY_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_OSC8MRDY_Pos) /* (SYSCTRL_INTENCLR) OSC8M Ready Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_OSC8MRDY(value)                                                                               \
        (SYSCTRL_INTENCLR_OSC8MRDY_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_OSC8MRDY_Pos)) /* Assigment of value for OSC8MRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLRDY_Pos _UINT32_(4) /* (SYSCTRL_INTENCLR) DFLL Ready Interrupt Enable Position */
#define SYSCTRL_INTENCLR_DFLLRDY_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_DFLLRDY_Pos) /* (SYSCTRL_INTENCLR) DFLL Ready Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_DFLLRDY(value)                                                                                \
        (SYSCTRL_INTENCLR_DFLLRDY_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLOOB_Pos _UINT32_(5) /* (SYSCTRL_INTENCLR) DFLL Out Of Bounds Interrupt Enable Position */
#define SYSCTRL_INTENCLR_DFLLOOB_Msk                                                                                   \
        (_UINT32_(0x1)                                                                                                 \
         << SYSCTRL_INTENCLR_DFLLOOB_Pos) /* (SYSCTRL_INTENCLR) DFLL Out Of Bounds Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_DFLLOOB(value)                                                                                \
        (SYSCTRL_INTENCLR_DFLLOOB_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLLCKF_Pos _UINT32_(6) /* (SYSCTRL_INTENCLR) DFLL Lock Fine Interrupt Enable Position */
#define SYSCTRL_INTENCLR_DFLLLCKF_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_DFLLLCKF_Pos) /* (SYSCTRL_INTENCLR) DFLL Lock Fine Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_DFLLLCKF(value)                                                                               \
        (SYSCTRL_INTENCLR_DFLLLCKF_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLLCKC_Pos _UINT32_(7) /* (SYSCTRL_INTENCLR) DFLL Lock Coarse Interrupt Enable Position */
#define SYSCTRL_INTENCLR_DFLLLCKC_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_DFLLLCKC_Pos) /* (SYSCTRL_INTENCLR) DFLL Lock Coarse Interrupt Enable Mask  \
                                                          */
#define SYSCTRL_INTENCLR_DFLLLCKC(value)                                                                               \
        (SYSCTRL_INTENCLR_DFLLLCKC_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DFLLRCS_Pos                                                                                   \
        _UINT32_(8) /* (SYSCTRL_INTENCLR) DFLL Reference Clock Stopped Interrupt Enable Position */
#define SYSCTRL_INTENCLR_DFLLRCS_Msk                                                                                   \
        (_UINT32_(0x1)                                                                                                 \
         << SYSCTRL_INTENCLR_DFLLRCS_Pos) /* (SYSCTRL_INTENCLR) DFLL Reference Clock Stopped Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_DFLLRCS(value)                                                                                \
        (SYSCTRL_INTENCLR_DFLLRCS_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_BOD33RDY_Pos _UINT32_(9) /* (SYSCTRL_INTENCLR) BOD33 Ready Interrupt Enable Position */
#define SYSCTRL_INTENCLR_BOD33RDY_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_BOD33RDY_Pos) /* (SYSCTRL_INTENCLR) BOD33 Ready Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_BOD33RDY(value)                                                                               \
        (SYSCTRL_INTENCLR_BOD33RDY_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_BOD33RDY_Pos)) /* Assigment of value for BOD33RDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_BOD33DET_Pos _UINT32_(10) /* (SYSCTRL_INTENCLR) BOD33 Detection Interrupt Enable Position */
#define SYSCTRL_INTENCLR_BOD33DET_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_BOD33DET_Pos) /* (SYSCTRL_INTENCLR) BOD33 Detection Interrupt Enable Mask   \
                                                          */
#define SYSCTRL_INTENCLR_BOD33DET(value)                                                                               \
        (SYSCTRL_INTENCLR_BOD33DET_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_BOD33DET_Pos)) /* Assigment of value for BOD33DET in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_B33SRDY_Pos                                                                                   \
        _UINT32_(11) /* (SYSCTRL_INTENCLR) BOD33 Synchronization Ready Interrupt Enable Position */
#define SYSCTRL_INTENCLR_B33SRDY_Msk                                                                                   \
        (_UINT32_(0x1)                                                                                                 \
         << SYSCTRL_INTENCLR_B33SRDY_Pos) /* (SYSCTRL_INTENCLR) BOD33 Synchronization Ready Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_B33SRDY(value)                                                                                \
        (SYSCTRL_INTENCLR_B33SRDY_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_B33SRDY_Pos)) /* Assigment of value for B33SRDY in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DPLLLCKR_Pos _UINT32_(15) /* (SYSCTRL_INTENCLR) DPLL Lock Rise Interrupt Enable Position */
#define SYSCTRL_INTENCLR_DPLLLCKR_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_DPLLLCKR_Pos) /* (SYSCTRL_INTENCLR) DPLL Lock Rise Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_DPLLLCKR(value)                                                                               \
        (SYSCTRL_INTENCLR_DPLLLCKR_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DPLLLCKF_Pos _UINT32_(16) /* (SYSCTRL_INTENCLR) DPLL Lock Fall Interrupt Enable Position */
#define SYSCTRL_INTENCLR_DPLLLCKF_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_DPLLLCKF_Pos) /* (SYSCTRL_INTENCLR) DPLL Lock Fall Interrupt Enable Mask */
#define SYSCTRL_INTENCLR_DPLLLCKF(value)                                                                               \
        (SYSCTRL_INTENCLR_DPLLLCKF_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_DPLLLTO_Pos _UINT32_(17) /* (SYSCTRL_INTENCLR) DPLL Lock Timeout Interrupt Enable Position */
#define SYSCTRL_INTENCLR_DPLLLTO_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTENCLR_DPLLLTO_Pos) /* (SYSCTRL_INTENCLR) DPLL Lock Timeout Interrupt Enable Mask  \
                                                         */
#define SYSCTRL_INTENCLR_DPLLLTO(value)                                                                                \
        (SYSCTRL_INTENCLR_DPLLLTO_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENCLR_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the SYSCTRL_INTENCLR register */
#define SYSCTRL_INTENCLR_Msk _UINT32_(0x00038FFF) /* (SYSCTRL_INTENCLR) Register Mask  */


/* -------- SYSCTRL_INTENSET : (SYSCTRL Offset: 0x04) (R/W 32) Interrupt Enable Set -------- */
#define SYSCTRL_INTENSET_RESETVALUE _UINT32_(0x00) /*  (SYSCTRL_INTENSET) Interrupt Enable Set  Reset Value */

