ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sysctrl.h
#define SYSCTRL_INTENSET_XOSCRDY_Pos _UINT32_(0) /* (SYSCTRL_INTENSET) XOSC Ready Interrupt Enable Position */
#define SYSCTRL_INTENSET_XOSCRDY_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_XOSCRDY_Pos) /* (SYSCTRL_INTENSET) XOSC Ready Interrupt Enable Mask */
#define SYSCTRL_INTENSET_XOSCRDY(value)                                                                                \
        (SYSCTRL_INTENSET_XOSCRDY_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_XOSC32KRDY_Pos _UINT32_(1) /* (SYSCTRL_INTENSET) XOSC32K Ready Interrupt Enable Position */
#define SYSCTRL_INTENSET_XOSC32KRDY_Msk                                                                                \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_XOSC32KRDY_Pos) /* (SYSCTRL_INTENSET) XOSC32K Ready Interrupt Enable Mask   \
                                                            */
#define SYSCTRL_INTENSET_XOSC32KRDY(value)                                                                             \
        (SYSCTRL_INTENSET_XOSC32KRDY_Msk &                                                                             \
         (_UINT32_(value) << SYSCTRL_INTENSET_XOSC32KRDY_Pos)) /* Assigment of value for XOSC32KRDY in the             \
                                                                  SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_OSC32KRDY_Pos _UINT32_(2) /* (SYSCTRL_INTENSET) OSC32K Ready Interrupt Enable Position */
#define SYSCTRL_INTENSET_OSC32KRDY_Msk                                                                                 \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_OSC32KRDY_Pos) /* (SYSCTRL_INTENSET) OSC32K Ready Interrupt Enable Mask */
#define SYSCTRL_INTENSET_OSC32KRDY(value)                                                                              \
        (SYSCTRL_INTENSET_OSC32KRDY_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_OSC32KRDY_Pos)) /* Assigment of value for OSC32KRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_OSC8MRDY_Pos _UINT32_(3) /* (SYSCTRL_INTENSET) OSC8M Ready Interrupt Enable Position */
#define SYSCTRL_INTENSET_OSC8MRDY_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_OSC8MRDY_Pos) /* (SYSCTRL_INTENSET) OSC8M Ready Interrupt Enable Mask */
#define SYSCTRL_INTENSET_OSC8MRDY(value)                                                                               \
        (SYSCTRL_INTENSET_OSC8MRDY_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_OSC8MRDY_Pos)) /* Assigment of value for OSC8MRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLRDY_Pos _UINT32_(4) /* (SYSCTRL_INTENSET) DFLL Ready Interrupt Enable Position */
#define SYSCTRL_INTENSET_DFLLRDY_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_DFLLRDY_Pos) /* (SYSCTRL_INTENSET) DFLL Ready Interrupt Enable Mask */
#define SYSCTRL_INTENSET_DFLLRDY(value)                                                                                \
        (SYSCTRL_INTENSET_DFLLRDY_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLOOB_Pos _UINT32_(5) /* (SYSCTRL_INTENSET) DFLL Out Of Bounds Interrupt Enable Position */
#define SYSCTRL_INTENSET_DFLLOOB_Msk                                                                                   \
        (_UINT32_(0x1)                                                                                                 \
         << SYSCTRL_INTENSET_DFLLOOB_Pos) /* (SYSCTRL_INTENSET) DFLL Out Of Bounds Interrupt Enable Mask */
#define SYSCTRL_INTENSET_DFLLOOB(value)                                                                                \
        (SYSCTRL_INTENSET_DFLLOOB_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLLCKF_Pos _UINT32_(6) /* (SYSCTRL_INTENSET) DFLL Lock Fine Interrupt Enable Position */
#define SYSCTRL_INTENSET_DFLLLCKF_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_DFLLLCKF_Pos) /* (SYSCTRL_INTENSET) DFLL Lock Fine Interrupt Enable Mask */
#define SYSCTRL_INTENSET_DFLLLCKF(value)                                                                               \
        (SYSCTRL_INTENSET_DFLLLCKF_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLLCKC_Pos _UINT32_(7) /* (SYSCTRL_INTENSET) DFLL Lock Coarse Interrupt Enable Position */
#define SYSCTRL_INTENSET_DFLLLCKC_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_DFLLLCKC_Pos) /* (SYSCTRL_INTENSET) DFLL Lock Coarse Interrupt Enable Mask  \
                                                          */
#define SYSCTRL_INTENSET_DFLLLCKC(value)                                                                               \
        (SYSCTRL_INTENSET_DFLLLCKC_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DFLLRCS_Pos                                                                                   \
        _UINT32_(8) /* (SYSCTRL_INTENSET) DFLL Reference Clock Stopped Interrupt Enable Position */
#define SYSCTRL_INTENSET_DFLLRCS_Msk                                                                                   \
        (_UINT32_(0x1)                                                                                                 \
         << SYSCTRL_INTENSET_DFLLRCS_Pos) /* (SYSCTRL_INTENSET) DFLL Reference Clock Stopped Interrupt Enable Mask */
#define SYSCTRL_INTENSET_DFLLRCS(value)                                                                                \
        (SYSCTRL_INTENSET_DFLLRCS_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_BOD33RDY_Pos _UINT32_(9) /* (SYSCTRL_INTENSET) BOD33 Ready Interrupt Enable Position */
#define SYSCTRL_INTENSET_BOD33RDY_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_BOD33RDY_Pos) /* (SYSCTRL_INTENSET) BOD33 Ready Interrupt Enable Mask */
#define SYSCTRL_INTENSET_BOD33RDY(value)                                                                               \
        (SYSCTRL_INTENSET_BOD33RDY_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_BOD33RDY_Pos)) /* Assigment of value for BOD33RDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_BOD33DET_Pos _UINT32_(10) /* (SYSCTRL_INTENSET) BOD33 Detection Interrupt Enable Position */
#define SYSCTRL_INTENSET_BOD33DET_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_BOD33DET_Pos) /* (SYSCTRL_INTENSET) BOD33 Detection Interrupt Enable Mask   \
                                                          */
#define SYSCTRL_INTENSET_BOD33DET(value)                                                                               \
        (SYSCTRL_INTENSET_BOD33DET_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_BOD33DET_Pos)) /* Assigment of value for BOD33DET in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_B33SRDY_Pos                                                                                   \
        _UINT32_(11) /* (SYSCTRL_INTENSET) BOD33 Synchronization Ready Interrupt Enable Position */
#define SYSCTRL_INTENSET_B33SRDY_Msk                                                                                   \
        (_UINT32_(0x1)                                                                                                 \
         << SYSCTRL_INTENSET_B33SRDY_Pos) /* (SYSCTRL_INTENSET) BOD33 Synchronization Ready Interrupt Enable Mask */
#define SYSCTRL_INTENSET_B33SRDY(value)                                                                                \
        (SYSCTRL_INTENSET_B33SRDY_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_B33SRDY_Pos)) /* Assigment of value for B33SRDY in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DPLLLCKR_Pos _UINT32_(15) /* (SYSCTRL_INTENSET) DPLL Lock Rise Interrupt Enable Position */
#define SYSCTRL_INTENSET_DPLLLCKR_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_DPLLLCKR_Pos) /* (SYSCTRL_INTENSET) DPLL Lock Rise Interrupt Enable Mask */
#define SYSCTRL_INTENSET_DPLLLCKR(value)                                                                               \
        (SYSCTRL_INTENSET_DPLLLCKR_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DPLLLCKF_Pos _UINT32_(16) /* (SYSCTRL_INTENSET) DPLL Lock Fall Interrupt Enable Position */
#define SYSCTRL_INTENSET_DPLLLCKF_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_DPLLLCKF_Pos) /* (SYSCTRL_INTENSET) DPLL Lock Fall Interrupt Enable Mask */
#define SYSCTRL_INTENSET_DPLLLCKF(value)                                                                               \
        (SYSCTRL_INTENSET_DPLLLCKF_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_DPLLLTO_Pos _UINT32_(17) /* (SYSCTRL_INTENSET) DPLL Lock Timeout Interrupt Enable Position */
#define SYSCTRL_INTENSET_DPLLLTO_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTENSET_DPLLLTO_Pos) /* (SYSCTRL_INTENSET) DPLL Lock Timeout Interrupt Enable Mask  \
                                                         */
#define SYSCTRL_INTENSET_DPLLLTO(value)                                                                                \
        (SYSCTRL_INTENSET_DPLLLTO_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTENSET_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the SYSCTRL_INTENSET register */
#define SYSCTRL_INTENSET_Msk _UINT32_(0x00038FFF) /* (SYSCTRL_INTENSET) Register Mask  */


/* -------- SYSCTRL_INTFLAG : (SYSCTRL Offset: 0x08) (R/W 32) Interrupt Flag Status and Clear -------- */
#define SYSCTRL_INTFLAG_RESETVALUE _UINT32_(0x00) /*  (SYSCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value   \
                                                   */

