ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sysctrl.h
#define SYSCTRL_INTFLAG_XOSCRDY_Pos _UINT32_(0) /* (SYSCTRL_INTFLAG) XOSC Ready Position */
#define SYSCTRL_INTFLAG_XOSCRDY_Msk                                                                                    \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_XOSCRDY_Pos) /* (SYSCTRL_INTFLAG) XOSC Ready Mask */
#define SYSCTRL_INTFLAG_XOSCRDY(value)                                                                                 \
        (SYSCTRL_INTFLAG_XOSCRDY_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_XOSC32KRDY_Pos _UINT32_(1) /* (SYSCTRL_INTFLAG) XOSC32K Ready Position */
#define SYSCTRL_INTFLAG_XOSC32KRDY_Msk                                                                                 \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_XOSC32KRDY_Pos) /* (SYSCTRL_INTFLAG) XOSC32K Ready Mask */
#define SYSCTRL_INTFLAG_XOSC32KRDY(value)                                                                              \
        (SYSCTRL_INTFLAG_XOSC32KRDY_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_XOSC32KRDY_Pos)) /* Assigment of value for XOSC32KRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_OSC32KRDY_Pos _UINT32_(2) /* (SYSCTRL_INTFLAG) OSC32K Ready Position */
#define SYSCTRL_INTFLAG_OSC32KRDY_Msk                                                                                  \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_OSC32KRDY_Pos) /* (SYSCTRL_INTFLAG) OSC32K Ready Mask */
#define SYSCTRL_INTFLAG_OSC32KRDY(value)                                                                               \
        (SYSCTRL_INTFLAG_OSC32KRDY_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_OSC32KRDY_Pos)) /* Assigment of value for OSC32KRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_OSC8MRDY_Pos _UINT32_(3) /* (SYSCTRL_INTFLAG) OSC8M Ready Position */
#define SYSCTRL_INTFLAG_OSC8MRDY_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_OSC8MRDY_Pos) /* (SYSCTRL_INTFLAG) OSC8M Ready Mask */
#define SYSCTRL_INTFLAG_OSC8MRDY(value)                                                                                \
        (SYSCTRL_INTFLAG_OSC8MRDY_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_OSC8MRDY_Pos)) /* Assigment of value for OSC8MRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLRDY_Pos _UINT32_(4) /* (SYSCTRL_INTFLAG) DFLL Ready Position */
#define SYSCTRL_INTFLAG_DFLLRDY_Msk                                                                                    \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLRDY_Pos) /* (SYSCTRL_INTFLAG) DFLL Ready Mask */
#define SYSCTRL_INTFLAG_DFLLRDY(value)                                                                                 \
        (SYSCTRL_INTFLAG_DFLLRDY_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLOOB_Pos _UINT32_(5) /* (SYSCTRL_INTFLAG) DFLL Out Of Bounds Position */
#define SYSCTRL_INTFLAG_DFLLOOB_Msk                                                                                    \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLOOB_Pos) /* (SYSCTRL_INTFLAG) DFLL Out Of Bounds Mask */
#define SYSCTRL_INTFLAG_DFLLOOB(value)                                                                                 \
        (SYSCTRL_INTFLAG_DFLLOOB_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLLCKF_Pos _UINT32_(6) /* (SYSCTRL_INTFLAG) DFLL Lock Fine Position */
#define SYSCTRL_INTFLAG_DFLLLCKF_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLLCKF_Pos) /* (SYSCTRL_INTFLAG) DFLL Lock Fine Mask */
#define SYSCTRL_INTFLAG_DFLLLCKF(value)                                                                                \
        (SYSCTRL_INTFLAG_DFLLLCKF_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLLCKC_Pos _UINT32_(7) /* (SYSCTRL_INTFLAG) DFLL Lock Coarse Position */
#define SYSCTRL_INTFLAG_DFLLLCKC_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLLCKC_Pos) /* (SYSCTRL_INTFLAG) DFLL Lock Coarse Mask */
#define SYSCTRL_INTFLAG_DFLLLCKC(value)                                                                                \
        (SYSCTRL_INTFLAG_DFLLLCKC_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DFLLRCS_Pos _UINT32_(8) /* (SYSCTRL_INTFLAG) DFLL Reference Clock Stopped Position */
#define SYSCTRL_INTFLAG_DFLLRCS_Msk                                                                                    \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_DFLLRCS_Pos) /* (SYSCTRL_INTFLAG) DFLL Reference Clock Stopped Mask */
#define SYSCTRL_INTFLAG_DFLLRCS(value)                                                                                 \
        (SYSCTRL_INTFLAG_DFLLRCS_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_BOD33RDY_Pos _UINT32_(9) /* (SYSCTRL_INTFLAG) BOD33 Ready Position */
#define SYSCTRL_INTFLAG_BOD33RDY_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_BOD33RDY_Pos) /* (SYSCTRL_INTFLAG) BOD33 Ready Mask */
#define SYSCTRL_INTFLAG_BOD33RDY(value)                                                                                \
        (SYSCTRL_INTFLAG_BOD33RDY_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_BOD33RDY_Pos)) /* Assigment of value for BOD33RDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_BOD33DET_Pos _UINT32_(10) /* (SYSCTRL_INTFLAG) BOD33 Detection Position */
#define SYSCTRL_INTFLAG_BOD33DET_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_BOD33DET_Pos) /* (SYSCTRL_INTFLAG) BOD33 Detection Mask */
#define SYSCTRL_INTFLAG_BOD33DET(value)                                                                                \
        (SYSCTRL_INTFLAG_BOD33DET_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_BOD33DET_Pos)) /* Assigment of value for BOD33DET in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_B33SRDY_Pos _UINT32_(11) /* (SYSCTRL_INTFLAG) BOD33 Synchronization Ready Position */
#define SYSCTRL_INTFLAG_B33SRDY_Msk                                                                                    \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_B33SRDY_Pos) /* (SYSCTRL_INTFLAG) BOD33 Synchronization Ready Mask */
#define SYSCTRL_INTFLAG_B33SRDY(value)                                                                                 \
        (SYSCTRL_INTFLAG_B33SRDY_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_B33SRDY_Pos)) /* Assigment of value for B33SRDY in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DPLLLCKR_Pos _UINT32_(15) /* (SYSCTRL_INTFLAG) DPLL Lock Rise Position */
#define SYSCTRL_INTFLAG_DPLLLCKR_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_DPLLLCKR_Pos) /* (SYSCTRL_INTFLAG) DPLL Lock Rise Mask */
#define SYSCTRL_INTFLAG_DPLLLCKR(value)                                                                                \
        (SYSCTRL_INTFLAG_DPLLLCKR_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_DPLLLCKR_Pos)) /* Assigment of value for DPLLLCKR in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DPLLLCKF_Pos _UINT32_(16) /* (SYSCTRL_INTFLAG) DPLL Lock Fall Position */
#define SYSCTRL_INTFLAG_DPLLLCKF_Msk                                                                                   \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_DPLLLCKF_Pos) /* (SYSCTRL_INTFLAG) DPLL Lock Fall Mask */
#define SYSCTRL_INTFLAG_DPLLLCKF(value)                                                                                \
        (SYSCTRL_INTFLAG_DPLLLCKF_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_DPLLLCKF_Pos)) /* Assigment of value for DPLLLCKF in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_DPLLLTO_Pos _UINT32_(17) /* (SYSCTRL_INTFLAG) DPLL Lock Timeout Position */
#define SYSCTRL_INTFLAG_DPLLLTO_Msk                                                                                    \
        (_UINT32_(0x1) << SYSCTRL_INTFLAG_DPLLLTO_Pos) /* (SYSCTRL_INTFLAG) DPLL Lock Timeout Mask */
#define SYSCTRL_INTFLAG_DPLLLTO(value)                                                                                 \
        (SYSCTRL_INTFLAG_DPLLLTO_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_INTFLAG_DPLLLTO_Pos)) /* Assigment of value for DPLLLTO in the SYSCTRL_INTFLAG register */
#define SYSCTRL_INTFLAG_Msk _UINT32_(0x00038FFF) /* (SYSCTRL_INTFLAG) Register Mask  */


/* -------- SYSCTRL_PCLKSR : (SYSCTRL Offset: 0x0C) ( R/ 32) Power and Clocks Status -------- */
#define SYSCTRL_PCLKSR_RESETVALUE _UINT32_(0x00) /*  (SYSCTRL_PCLKSR) Power and Clocks Status  Reset Value */

