ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sysctrl.h
#define SYSCTRL_OSC8M_ENABLE_Pos _UINT32_(1) /* (SYSCTRL_OSC8M) Oscillator Enable Position */
#define SYSCTRL_OSC8M_ENABLE_Msk                                                                                       \
        (_UINT32_(0x1) << SYSCTRL_OSC8M_ENABLE_Pos) /* (SYSCTRL_OSC8M) Oscillator Enable Mask */
#define SYSCTRL_OSC8M_ENABLE(value)                                                                                    \
        (SYSCTRL_OSC8M_ENABLE_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_OSC8M_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_RUNSTDBY_Pos _UINT32_(6) /* (SYSCTRL_OSC8M) Run in Standby Position */
#define SYSCTRL_OSC8M_RUNSTDBY_Msk                                                                                     \
        (_UINT32_(0x1) << SYSCTRL_OSC8M_RUNSTDBY_Pos) /* (SYSCTRL_OSC8M) Run in Standby Mask */
#define SYSCTRL_OSC8M_RUNSTDBY(value)                                                                                  \
        (SYSCTRL_OSC8M_RUNSTDBY_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_OSC8M_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_ONDEMAND_Pos _UINT32_(7) /* (SYSCTRL_OSC8M) On Demand Control Position */
#define SYSCTRL_OSC8M_ONDEMAND_Msk                                                                                     \
        (_UINT32_(0x1) << SYSCTRL_OSC8M_ONDEMAND_Pos) /* (SYSCTRL_OSC8M) On Demand Control Mask */
#define SYSCTRL_OSC8M_ONDEMAND(value)                                                                                  \
        (SYSCTRL_OSC8M_ONDEMAND_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_OSC8M_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_PRESC_Pos _UINT32_(8) /* (SYSCTRL_OSC8M) Oscillator Prescaler Position */
#define SYSCTRL_OSC8M_PRESC_Msk                                                                                        \
        (_UINT32_(0x3) << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) Oscillator Prescaler Mask */
#define SYSCTRL_OSC8M_PRESC(value)                                                                                     \
        (SYSCTRL_OSC8M_PRESC_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_OSC8M_PRESC_Pos)) /* Assigment of value for PRESC in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_PRESC_0_Val _UINT32_(0x0) /* (SYSCTRL_OSC8M) 1  */
#define SYSCTRL_OSC8M_PRESC_1_Val _UINT32_(0x1) /* (SYSCTRL_OSC8M) 2  */
#define SYSCTRL_OSC8M_PRESC_2_Val _UINT32_(0x2) /* (SYSCTRL_OSC8M) 4  */
#define SYSCTRL_OSC8M_PRESC_3_Val _UINT32_(0x3) /* (SYSCTRL_OSC8M) 8  */
#define SYSCTRL_OSC8M_PRESC_0 (SYSCTRL_OSC8M_PRESC_0_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 1 Position  */
#define SYSCTRL_OSC8M_PRESC_1 (SYSCTRL_OSC8M_PRESC_1_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 2 Position  */
#define SYSCTRL_OSC8M_PRESC_2 (SYSCTRL_OSC8M_PRESC_2_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 4 Position  */
#define SYSCTRL_OSC8M_PRESC_3 (SYSCTRL_OSC8M_PRESC_3_Val << SYSCTRL_OSC8M_PRESC_Pos) /* (SYSCTRL_OSC8M) 8 Position  */
#define SYSCTRL_OSC8M_CALIB_Pos _UINT32_(16) /* (SYSCTRL_OSC8M) Oscillator Calibration Position */
#define SYSCTRL_OSC8M_CALIB_Msk                                                                                        \
        (_UINT32_(0xFFF) << SYSCTRL_OSC8M_CALIB_Pos) /* (SYSCTRL_OSC8M) Oscillator Calibration Mask */
#define SYSCTRL_OSC8M_CALIB(value)                                                                                     \
        (SYSCTRL_OSC8M_CALIB_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_OSC8M_CALIB_Pos)) /* Assigment of value for CALIB in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_FRANGE_Pos _UINT32_(30) /* (SYSCTRL_OSC8M) Oscillator Frequency Range Position */
#define SYSCTRL_OSC8M_FRANGE_Msk                                                                                       \
        (_UINT32_(0x3) << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) Oscillator Frequency Range Mask */
#define SYSCTRL_OSC8M_FRANGE(value)                                                                                    \
        (SYSCTRL_OSC8M_FRANGE_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_OSC8M_FRANGE_Pos)) /* Assigment of value for FRANGE in the SYSCTRL_OSC8M register */
#define SYSCTRL_OSC8M_FRANGE_0_Val _UINT32_(0x0) /* (SYSCTRL_OSC8M) 4 to 6MHz  */
#define SYSCTRL_OSC8M_FRANGE_1_Val _UINT32_(0x1) /* (SYSCTRL_OSC8M) 6 to 8MHz  */
#define SYSCTRL_OSC8M_FRANGE_2_Val _UINT32_(0x2) /* (SYSCTRL_OSC8M) 8 to 11MHz  */
#define SYSCTRL_OSC8M_FRANGE_3_Val _UINT32_(0x3) /* (SYSCTRL_OSC8M) 11 to 15MHz  */
#define SYSCTRL_OSC8M_FRANGE_0                                                                                         \
        (SYSCTRL_OSC8M_FRANGE_0_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 4 to 6MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_1                                                                                         \
        (SYSCTRL_OSC8M_FRANGE_1_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 6 to 8MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_2                                                                                         \
        (SYSCTRL_OSC8M_FRANGE_2_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 8 to 11MHz Position  */
#define SYSCTRL_OSC8M_FRANGE_3                                                                                         \
        (SYSCTRL_OSC8M_FRANGE_3_Val << SYSCTRL_OSC8M_FRANGE_Pos) /* (SYSCTRL_OSC8M) 11 to 15MHz Position  */
#define SYSCTRL_OSC8M_Msk _UINT32_(0xCFFF03C2) /* (SYSCTRL_OSC8M) Register Mask  */


/* -------- SYSCTRL_DFLLCTRL : (SYSCTRL Offset: 0x24) (R/W 16) DFLL48M Control -------- */
#define SYSCTRL_DFLLCTRL_RESETVALUE _UINT16_(0x80) /*  (SYSCTRL_DFLLCTRL) DFLL48M Control  Reset Value */

