ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sysctrl.h
#define SYSCTRL_BOD33_ENABLE_Pos _UINT32_(1) /* (SYSCTRL_BOD33) Enable Position */
#define SYSCTRL_BOD33_ENABLE_Msk (_UINT32_(0x1) << SYSCTRL_BOD33_ENABLE_Pos) /* (SYSCTRL_BOD33) Enable Mask */
#define SYSCTRL_BOD33_ENABLE(value)                                                                                    \
        (SYSCTRL_BOD33_ENABLE_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_BOD33_ENABLE_Pos)) /* Assigment of value for ENABLE in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_HYST_Pos _UINT32_(2) /* (SYSCTRL_BOD33) Hysteresis Position */
#define SYSCTRL_BOD33_HYST_Msk (_UINT32_(0x1) << SYSCTRL_BOD33_HYST_Pos) /* (SYSCTRL_BOD33) Hysteresis Mask */
#define SYSCTRL_BOD33_HYST(value)                                                                                      \
        (SYSCTRL_BOD33_HYST_Msk &                                                                                      \
         (_UINT32_(value) << SYSCTRL_BOD33_HYST_Pos)) /* Assigment of value for HYST in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_ACTION_Pos _UINT32_(3) /* (SYSCTRL_BOD33) BOD33 Action Position */
#define SYSCTRL_BOD33_ACTION_Msk (_UINT32_(0x3) << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) BOD33 Action Mask */
#define SYSCTRL_BOD33_ACTION(value)                                                                                    \
        (SYSCTRL_BOD33_ACTION_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_BOD33_ACTION_Pos)) /* Assigment of value for ACTION in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_ACTION_NONE_Val _UINT32_(0x0) /* (SYSCTRL_BOD33) No action  */
#define SYSCTRL_BOD33_ACTION_RESET_Val _UINT32_(0x1) /* (SYSCTRL_BOD33) The BOD33 generates a reset  */
#define SYSCTRL_BOD33_ACTION_INTERRUPT_Val _UINT32_(0x2) /* (SYSCTRL_BOD33) The BOD33 generates an interrupt  */
#define SYSCTRL_BOD33_ACTION_NONE                                                                                      \
        (SYSCTRL_BOD33_ACTION_NONE_Val << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) No action Position  */
#define SYSCTRL_BOD33_ACTION_RESET                                                                                     \
        (                                                                                                              \
                SYSCTRL_BOD33_ACTION_RESET_Val                                                                         \
                << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) The BOD33 generates a reset Position  */
#define SYSCTRL_BOD33_ACTION_INTERRUPT                                                                                 \
        (SYSCTRL_BOD33_ACTION_INTERRUPT_Val                                                                            \
         << SYSCTRL_BOD33_ACTION_Pos) /* (SYSCTRL_BOD33) The BOD33 generates an interrupt Position  */
#define SYSCTRL_BOD33_RUNSTDBY_Pos _UINT32_(6) /* (SYSCTRL_BOD33) Run in Standby Position */
#define SYSCTRL_BOD33_RUNSTDBY_Msk                                                                                     \
        (_UINT32_(0x1) << SYSCTRL_BOD33_RUNSTDBY_Pos) /* (SYSCTRL_BOD33) Run in Standby Mask */
#define SYSCTRL_BOD33_RUNSTDBY(value)                                                                                  \
        (SYSCTRL_BOD33_RUNSTDBY_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_BOD33_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_MODE_Pos _UINT32_(8) /* (SYSCTRL_BOD33) Operation Mode Position */
#define SYSCTRL_BOD33_MODE_Msk (_UINT32_(0x1) << SYSCTRL_BOD33_MODE_Pos) /* (SYSCTRL_BOD33) Operation Mode Mask */
#define SYSCTRL_BOD33_MODE(value)                                                                                      \
        (SYSCTRL_BOD33_MODE_Msk &                                                                                      \
         (_UINT32_(value) << SYSCTRL_BOD33_MODE_Pos)) /* Assigment of value for MODE in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_CEN_Pos _UINT32_(9) /* (SYSCTRL_BOD33) Clock Enable Position */
#define SYSCTRL_BOD33_CEN_Msk (_UINT32_(0x1) << SYSCTRL_BOD33_CEN_Pos) /* (SYSCTRL_BOD33) Clock Enable Mask */
#define SYSCTRL_BOD33_CEN(value)                                                                                       \
        (SYSCTRL_BOD33_CEN_Msk &                                                                                       \
         (_UINT32_(value) << SYSCTRL_BOD33_CEN_Pos)) /* Assigment of value for CEN in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_PSEL_Pos _UINT32_(12) /* (SYSCTRL_BOD33) Prescaler Select Position */
#define SYSCTRL_BOD33_PSEL_Msk (_UINT32_(0xF) << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Prescaler Select Mask */
#define SYSCTRL_BOD33_PSEL(value)                                                                                      \
        (SYSCTRL_BOD33_PSEL_Msk &                                                                                      \
         (_UINT32_(value) << SYSCTRL_BOD33_PSEL_Pos)) /* Assigment of value for PSEL in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_PSEL_DIV2_Val _UINT32_(0x0) /* (SYSCTRL_BOD33) Divide clock by 2  */
#define SYSCTRL_BOD33_PSEL_DIV4_Val _UINT32_(0x1) /* (SYSCTRL_BOD33) Divide clock by 4  */
#define SYSCTRL_BOD33_PSEL_DIV8_Val _UINT32_(0x2) /* (SYSCTRL_BOD33) Divide clock by 8  */
#define SYSCTRL_BOD33_PSEL_DIV16_Val _UINT32_(0x3) /* (SYSCTRL_BOD33) Divide clock by 16  */
#define SYSCTRL_BOD33_PSEL_DIV32_Val _UINT32_(0x4) /* (SYSCTRL_BOD33) Divide clock by 32  */
#define SYSCTRL_BOD33_PSEL_DIV64_Val _UINT32_(0x5) /* (SYSCTRL_BOD33) Divide clock by 64  */
#define SYSCTRL_BOD33_PSEL_DIV128_Val _UINT32_(0x6) /* (SYSCTRL_BOD33) Divide clock by 128  */
#define SYSCTRL_BOD33_PSEL_DIV256_Val _UINT32_(0x7) /* (SYSCTRL_BOD33) Divide clock by 256  */
#define SYSCTRL_BOD33_PSEL_DIV512_Val _UINT32_(0x8) /* (SYSCTRL_BOD33) Divide clock by 512  */
#define SYSCTRL_BOD33_PSEL_DIV1K_Val _UINT32_(0x9) /* (SYSCTRL_BOD33) Divide clock by 1024  */
#define SYSCTRL_BOD33_PSEL_DIV2K_Val _UINT32_(0xA) /* (SYSCTRL_BOD33) Divide clock by 2048  */
#define SYSCTRL_BOD33_PSEL_DIV4K_Val _UINT32_(0xB) /* (SYSCTRL_BOD33) Divide clock by 4096  */
#define SYSCTRL_BOD33_PSEL_DIV8K_Val _UINT32_(0xC) /* (SYSCTRL_BOD33) Divide clock by 8192  */
#define SYSCTRL_BOD33_PSEL_DIV16K_Val _UINT32_(0xD) /* (SYSCTRL_BOD33) Divide clock by 16384  */
#define SYSCTRL_BOD33_PSEL_DIV32K_Val _UINT32_(0xE) /* (SYSCTRL_BOD33) Divide clock by 32768  */
#define SYSCTRL_BOD33_PSEL_DIV64K_Val _UINT32_(0xF) /* (SYSCTRL_BOD33) Divide clock by 65536  */
#define SYSCTRL_BOD33_PSEL_DIV2                                                                                        \
        (SYSCTRL_BOD33_PSEL_DIV2_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 2 Position  */
#define SYSCTRL_BOD33_PSEL_DIV4                                                                                        \
        (SYSCTRL_BOD33_PSEL_DIV4_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 4 Position  */
#define SYSCTRL_BOD33_PSEL_DIV8                                                                                        \
        (SYSCTRL_BOD33_PSEL_DIV8_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 8 Position  */
#define SYSCTRL_BOD33_PSEL_DIV16                                                                                       \
        (SYSCTRL_BOD33_PSEL_DIV16_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 16 Position  */
#define SYSCTRL_BOD33_PSEL_DIV32                                                                                       \
        (SYSCTRL_BOD33_PSEL_DIV32_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 32 Position  */
#define SYSCTRL_BOD33_PSEL_DIV64                                                                                       \
        (SYSCTRL_BOD33_PSEL_DIV64_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 64 Position  */
#define SYSCTRL_BOD33_PSEL_DIV128                                                                                      \
        (SYSCTRL_BOD33_PSEL_DIV128_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 128 Position  */
#define SYSCTRL_BOD33_PSEL_DIV256                                                                                      \
        (SYSCTRL_BOD33_PSEL_DIV256_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 256 Position  */
#define SYSCTRL_BOD33_PSEL_DIV512                                                                                      \
        (SYSCTRL_BOD33_PSEL_DIV512_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 512 Position  */
#define SYSCTRL_BOD33_PSEL_DIV1K                                                                                       \
        (SYSCTRL_BOD33_PSEL_DIV1K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 1024 Position  */
#define SYSCTRL_BOD33_PSEL_DIV2K                                                                                       \
        (SYSCTRL_BOD33_PSEL_DIV2K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 2048 Position  */
#define SYSCTRL_BOD33_PSEL_DIV4K                                                                                       \
        (SYSCTRL_BOD33_PSEL_DIV4K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 4096 Position  */
#define SYSCTRL_BOD33_PSEL_DIV8K                                                                                       \
        (SYSCTRL_BOD33_PSEL_DIV8K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 8192 Position  */
#define SYSCTRL_BOD33_PSEL_DIV16K                                                                                      \
        (SYSCTRL_BOD33_PSEL_DIV16K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 16384 Position */
#define SYSCTRL_BOD33_PSEL_DIV32K                                                                                      \
        (SYSCTRL_BOD33_PSEL_DIV32K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 32768 Position */
#define SYSCTRL_BOD33_PSEL_DIV64K                                                                                      \
        (SYSCTRL_BOD33_PSEL_DIV64K_Val << SYSCTRL_BOD33_PSEL_Pos) /* (SYSCTRL_BOD33) Divide clock by 65536 Position */
#define SYSCTRL_BOD33_LEVEL_Pos _UINT32_(16) /* (SYSCTRL_BOD33) BOD33 Threshold Level Position */
#define SYSCTRL_BOD33_LEVEL_Msk                                                                                        \
        (_UINT32_(0x3F) << SYSCTRL_BOD33_LEVEL_Pos) /* (SYSCTRL_BOD33) BOD33 Threshold Level Mask */
#define SYSCTRL_BOD33_LEVEL(value)                                                                                     \
        (SYSCTRL_BOD33_LEVEL_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << SYSCTRL_BOD33_LEVEL_Pos)) /* Assigment of value for LEVEL in the SYSCTRL_BOD33 register */
#define SYSCTRL_BOD33_Msk _UINT32_(0x003FF35E) /* (SYSCTRL_BOD33) Register Mask  */


/* -------- SYSCTRL_VREG : (SYSCTRL Offset: 0x3C) (R/W 16) Voltage Regulator System (VREG) Control -------- */
#define SYSCTRL_VREG_RESETVALUE                                                                                        \
        _UINT16_(0x00) /*  (SYSCTRL_VREG) Voltage Regulator System (VREG) Control  Reset Value */

#define SYSCTRL_VREG_RUNSTDBY_Pos _UINT16_(6) /* (SYSCTRL_VREG) Run in Standby Position */
#define SYSCTRL_VREG_RUNSTDBY_Msk (_UINT16_(0x1) << SYSCTRL_VREG_RUNSTDBY_Pos) /* (SYSCTRL_VREG) Run in Standby Mask   \
                                                                                */
#define SYSCTRL_VREG_RUNSTDBY(value)                                                                                   \
        (SYSCTRL_VREG_RUNSTDBY_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << SYSCTRL_VREG_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SYSCTRL_VREG register */
#define SYSCTRL_VREG_FORCELDO_Pos _UINT16_(13) /* (SYSCTRL_VREG) Force LDO Voltage Regulator Position */
#define SYSCTRL_VREG_FORCELDO_Msk                                                                                      \
        (_UINT16_(0x1) << SYSCTRL_VREG_FORCELDO_Pos) /* (SYSCTRL_VREG) Force LDO Voltage Regulator Mask */
#define SYSCTRL_VREG_FORCELDO(value)                                                                                   \
        (SYSCTRL_VREG_FORCELDO_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << SYSCTRL_VREG_FORCELDO_Pos)) /* Assigment of value for FORCELDO in the SYSCTRL_VREG register */
#define SYSCTRL_VREG_Msk _UINT16_(0x2040) /* (SYSCTRL_VREG) Register Mask  */


