ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/sysctrl.h
/** \brief SYSCTRL register offsets definitions */
#define SYSCTRL_INTENCLR_REG_OFST _UINT32_(0x00) /* (SYSCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define SYSCTRL_INTENSET_REG_OFST _UINT32_(0x04) /* (SYSCTRL_INTENSET) Interrupt Enable Set Offset */
#define SYSCTRL_INTFLAG_REG_OFST _UINT32_(0x08) /* (SYSCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define SYSCTRL_PCLKSR_REG_OFST _UINT32_(0x0C) /* (SYSCTRL_PCLKSR) Power and Clocks Status Offset */
#define SYSCTRL_XOSC_REG_OFST                                                                                          \
        _UINT32_(0x10) /* (SYSCTRL_XOSC) External Multipurpose Crystal Oscillator (XOSC) Control Offset */
#define SYSCTRL_XOSC32K_REG_OFST                                                                                       \
        _UINT32_(0x14) /* (SYSCTRL_XOSC32K) 32kHz External Crystal Oscillator (XOSC32K) Control Offset */
#define SYSCTRL_OSC32K_REG_OFST _UINT32_(0x18) /* (SYSCTRL_OSC32K) 32kHz Internal Oscillator (OSC32K) Control Offset   \
                                                */
#define SYSCTRL_OSCULP32K_REG_OFST                                                                                     \
        _UINT32_(0x1C) /* (SYSCTRL_OSCULP32K) 32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control Offset */
#define SYSCTRL_OSC8M_REG_OFST _UINT32_(0x20) /* (SYSCTRL_OSC8M) 8MHz Internal Oscillator (OSC8M) Control Offset */
#define SYSCTRL_DFLLCTRL_REG_OFST _UINT32_(0x24) /* (SYSCTRL_DFLLCTRL) DFLL48M Control Offset */
#define SYSCTRL_DFLLVAL_REG_OFST _UINT32_(0x28) /* (SYSCTRL_DFLLVAL) DFLL48M Value Offset */
#define SYSCTRL_DFLLMUL_REG_OFST _UINT32_(0x2C) /* (SYSCTRL_DFLLMUL) DFLL48M Multiplier Offset */
#define SYSCTRL_DFLLSYNC_REG_OFST _UINT32_(0x30) /* (SYSCTRL_DFLLSYNC) DFLL48M Synchronization Offset */
#define SYSCTRL_BOD33_REG_OFST _UINT32_(0x34) /* (SYSCTRL_BOD33) 3.3V Brown-Out Detector (BOD33) Control Offset */
#define SYSCTRL_VREG_REG_OFST _UINT32_(0x3C) /* (SYSCTRL_VREG) Voltage Regulator System (VREG) Control Offset */
#define SYSCTRL_VREF_REG_OFST _UINT32_(0x40) /* (SYSCTRL_VREF) Voltage References System (VREF) Control Offset */
#define SYSCTRL_DPLLCTRLA_REG_OFST _UINT32_(0x44) /* (SYSCTRL_DPLLCTRLA) DPLL Control A Offset */
#define SYSCTRL_DPLLRATIO_REG_OFST _UINT32_(0x48) /* (SYSCTRL_DPLLRATIO) DPLL Ratio Control Offset */
#define SYSCTRL_DPLLCTRLB_REG_OFST _UINT32_(0x4C) /* (SYSCTRL_DPLLCTRLB) DPLL Control B Offset */
#define SYSCTRL_DPLLSTATUS_REG_OFST _UINT32_(0x50) /* (SYSCTRL_DPLLSTATUS) DPLL Status Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SYSCTRL register API structure */
typedef struct { /* System Control */
        __IO uint32_t SYSCTRL_INTENCLR; /**< Offset: 0x00 (R/W  32) Interrupt Enable Clear */
        __IO uint32_t SYSCTRL_INTENSET; /**< Offset: 0x04 (R/W  32) Interrupt Enable Set */
        __IO uint32_t SYSCTRL_INTFLAG; /**< Offset: 0x08 (R/W  32) Interrupt Flag Status and Clear */
        __I uint32_t SYSCTRL_PCLKSR; /**< Offset: 0x0C (R/   32) Power and Clocks Status */
        __IO uint16_t
                SYSCTRL_XOSC; /**< Offset: 0x10 (R/W  16) External Multipurpose Crystal Oscillator (XOSC) Control */
        __I uint8_t Reserved1[0x02];
        __IO uint16_t
                SYSCTRL_XOSC32K; /**< Offset: 0x14 (R/W  16) 32kHz External Crystal Oscillator (XOSC32K) Control */
        __I uint8_t Reserved2[0x02];
        __IO uint32_t SYSCTRL_OSC32K; /**< Offset: 0x18 (R/W  32) 32kHz Internal Oscillator (OSC32K) Control */
        __IO uint8_t SYSCTRL_OSCULP32K; /**< Offset: 0x1C (R/W  8) 32kHz Ultra Low Power Internal Oscillator (OSCULP32K)
                                           Control */
        __I uint8_t Reserved3[0x03];
        __IO uint32_t SYSCTRL_OSC8M; /**< Offset: 0x20 (R/W  32) 8MHz Internal Oscillator (OSC8M) Control */
        __IO uint16_t SYSCTRL_DFLLCTRL; /**< Offset: 0x24 (R/W  16) DFLL48M Control */
        __I uint8_t Reserved4[0x02];
        __IO uint32_t SYSCTRL_DFLLVAL; /**< Offset: 0x28 (R/W  32) DFLL48M Value */
        __IO uint32_t SYSCTRL_DFLLMUL; /**< Offset: 0x2C (R/W  32) DFLL48M Multiplier */
        __IO uint8_t SYSCTRL_DFLLSYNC; /**< Offset: 0x30 (R/W  8) DFLL48M Synchronization */
        __I uint8_t Reserved5[0x03];
        __IO uint32_t SYSCTRL_BOD33; /**< Offset: 0x34 (R/W  32) 3.3V Brown-Out Detector (BOD33) Control */
        __I uint8_t Reserved6[0x04];
        __IO uint16_t SYSCTRL_VREG; /**< Offset: 0x3C (R/W  16) Voltage Regulator System (VREG) Control */
        __I uint8_t Reserved7[0x02];
        __IO uint32_t SYSCTRL_VREF; /**< Offset: 0x40 (R/W  32) Voltage References System (VREF) Control */
        __IO uint8_t SYSCTRL_DPLLCTRLA; /**< Offset: 0x44 (R/W  8) DPLL Control A */
        __I uint8_t Reserved8[0x03];
        __IO uint32_t SYSCTRL_DPLLRATIO; /**< Offset: 0x48 (R/W  32) DPLL Ratio Control */
        __IO uint32_t SYSCTRL_DPLLCTRLB; /**< Offset: 0x4C (R/W  32) DPLL Control B */
        __I uint8_t SYSCTRL_DPLLSTATUS; /**< Offset: 0x50 (R/   8) DPLL Status */
} sysctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_SYSCTRL_COMPONENT_H_ */
